Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C8C_0.xml
          </instance>
          <instance name="CMCC1">
            <register-group address-space="base" name="CMCC1" name-in-module="CMCC" offset="0x48018000"/>
          </instance>
        </module>
        <module name="EFC" version="6450M">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378E">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="ICM" version="11105B">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40044000"/>
          </instance>
        </module>
        <module name="IPC" version="11204A">
          <instance name="IPC0">
            <register-group address-space="base" name="IPC0" name-in-module="IPC" offset="0x4004C000"/>
          </instance>
          <instance name="IPC1">
            <register-group address-space="base" name="IPC1" name-in-module="IPC" offset="0x48014000"/>
          </instance>
        </module>
        <module name="MATRIX" version="11206B">
          <instance name="MATRIX0">
            <register-group address-space="base" name="MATRIX0" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
          <instance name="MATRIX1">
            <register-group address-space="base" name="MATRIX1" name-in-module="MATRIX" offset="0x48010000"/>
          </instance>
        </module>
        <module name="PIO" version="11004K">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x4800C000"/>
          </instance>
        </module>
        <module name="PMC" version="11116J">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA31" function="A" group="PCK" index="0"/>
              <signal pad="PB13" function="A" group="PCK" index="0"/>
              <signal pad="PA29" function="A" group="PCK" index="1"/>
              <signal pad="PA30" function="A" group="PCK" index="1"/>
              <signal pad="PA0" function="B" group="PCK" index="2"/>
              <signal pad="PB18" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6044J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x48008000"/>
            <signals>
              <signal pad="PC0" function="B" group="PWM" index="0"/>
              <signal pad="PC6" function="A" group="PWM" index="0"/>
              <signal pad="PC1" function="B" group="PWM" index="1"/>
              <signal pad="PC7" function="A" group="PWM" index="1"/>
              <signal pad="PC2" function="B" group="PWM" index="2"/>
              <signal pad="PC8" function="A" group="PWM" index="2"/>
              <signal pad="PC3" function="B" group="PWM" index="3"/>
              <signal pad="PC9" function="A" group="PWM" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009D">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="RSWDT" version="11110A">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x400E1500"/>
          </instance>
        </module>
        <module name="RTC" version="6056O">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
          </instance>
        </module>
        <module name="RTT" version="6081I">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
          </instance>
        </module>
        <module name="SLCDC" version="6259C">
          <instance name="SLCDC">
            <register-group address-space="base" name="SLCDC" name-in-module="SLCDC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA0" function="X1" group="COM" index="0"/>
              <signal pad="PA1" function="X1" group="COM" index="1"/>
              <signal pad="PA2" function="X1" group="COM" index="2"/>
              <signal pad="PA3" function="X1" group="COM" index="3"/>
              <signal pad="PA4" function="X1" group="COM" index="4"/>
              <signal pad="PA4" function="X1" group="AD" index="1"/>
              <signal pad="PA5" function="X1" group="COM" index="5"/>
              <signal pad="PA5" function="X1" group="AD" index="2"/>
              <signal pad="PA6" function="X1" group="SEG" index="0"/>
              <signal pad="PA7" function="X1" group="SEG" index="1"/>
              <signal pad="PA8" function="X1" group="SEG" index="2"/>
              <signal pad="PA9" function="X1" group="SEG" index="3"/>
              <signal pad="PA10" function="X1" group="SEG" index="4"/>
              <signal pad="PA11" function="X1" group="SEG" index="5"/>
              <signal pad="PA12" function="X1" group="SEG" index="6"/>
              <signal pad="PA12" function="X1" group="AD" index="0"/>
              <signal pad="PA13" function="X1" group="SEG" index="7"/>
              <signal pad="PA14" function="X1" group="SEG" index="8"/>
              <signal pad="PA15" function="X1" group="SEG" index="9"/>
              <signal pad="PA16" function="X1" group="SEG" index="10"/>
              <signal pad="PA17" function="X1" group="SEG" index="11"/>
              <signal pad="PA18" function="X1" group="SEG" index="12"/>
              <signal pad="PA19" function="X1" group="SEG" index="13"/>
              <signal pad="PA20" function="X1" group="SEG" index="14"/>
              <signal pad="PA21" function="X1" group="SEG" index="15"/>
              <signal pad="PA22" function="X1" group="SEG" index="16"/>
              <signal pad="PA23" function="X1" group="SEG" index="17"/>
              <signal pad="PA24" function="X1" group="SEG" index="18"/>
              <signal pad="PA25" function="X1" group="SEG" index="19"/>
              <signal pad="PA26" function="X1" group="SEG" index="20"/>
              <signal pad="PA27" function="X1" group="SEG" index="21"/>
              <signal pad="PA28" function="X1" group="SEG" index="22"/>
              <signal pad="PA29" function="X1" group="SEG" index="23"/>
              <signal pad="PB6" function="X1" group="SEG" index="24"/>
              <signal pad="PB7" function="X1" group="SEG" index="25"/>
              <signal pad="PB8" function="X1" group="SEG" index="26"/>
              <signal pad="PB9" function="X1" group="SEG" index="27"/>
              <signal pad="PB10" function="X1" group="SEG" index="28"/>
              <signal pad="PB11" function="X1" group="SEG" index="29"/>
              <signal pad="PB12" function="X1" group="SEG" index="30"/>
              <signal pad="PB13" function="X1" group="SEG" index="31"/>
              <signal pad="PB13" function="X1" group="AD" index="3"/>
              <signal pad="PB14" function="X1" group="SEG" index="32"/>
              <signal pad="PB15" function="X1" group="SEG" index="33"/>
              <signal pad="PB16" function="X1" group="SEG" index="34"/>
              <signal pad="PB17" function="X1" group="SEG" index="35"/>
              <signal pad="PB18" function="X1" group="SEG" index="36"/>
              <signal pad="PB19" function="X1" group="SEG" index="37"/>
              <signal pad="PB20" function="X1" group="SEG" index="38"/>
              <signal pad="PB21" function="X1" group="SEG" index="39"/>
              <signal pad="PB22" function="X1" group="SEG" index="40"/>
              <signal pad="PB23" function="X1" group="SEG" index="41"/>
              <signal pad="PB23" function="X1" group="AD" index="4"/>
              <signal pad="PB24" function="X1" group="SEG" index="42"/>
              <signal pad="PB25" function="X1" group="SEG" index="43"/>
              <signal pad="PB26" function="X1" group="SEG" index="44"/>
              <signal pad="PB27" function="X1" group="SEG" index="45"/>
              <signal pad="PB28" function="X1" group="SEG" index="46"/>
              <signal pad="PB29" function="X1" group="SEG" index="47"/>
              <signal pad="PB30" function="X1" group="SEG" index="48"/>
              <signal pad="PB31" function="X1" group="SEG" index="49"/>
              <signal pad="PB31" function="X1" group="AD" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="SMC" version="6498F">
          <instance name="SMC0">
            <register-group address-space="base" name="SMC0" name-in-module="SMC" offset="0x400E0000"/>
